<?php

namespace skill963
{
	//所有可能的商品列表
	//类别属性：min: 该类别最少刷新商品数，max: 该类别最多刷新商品数，items: 道具列表
	//道具的数值依次为：名称、类别、效果值、耐久值、属性、单价、耐久范围（0表示耐久固定，正整数表示最高倍数）、价格范围（0表示价格不变，正整数表示最多降低/升高X%）、权重、最低出现层数、最高出现层数
	//特殊的道具属性：rdsk_s、rdsk_a、rdsk_b、rdsk_c表示对应等级的一个随机技能；card_s、card_a、card_b、card_c表示对应等级的一张随机卡片，在生成商品列表时确定
	$skill963_shopitems = array(
		1 => array( //补给品
			'min' => 2,
			'max' => 4,
			'items' => array(
				array('食堂的盒饭','HR',50,1,'',300,10,20,30,2,7),
				array('矿泉水','HS',100,1,'',15,20,20,100,1,7),
				array('体力回复药','HS',200,1,'',25,20,20,70,2,7),
				array('圆形罐头','HS',400,1,'',45,20,20,30,2,7),
				array('面包','HH',100,1,'',20,20,20,100,1,7),
				array('治疗针','HH',200,1,'',55,20,20,70,2,7),
				array('超级治疗针','HH',400,1,'',120,20,30,100,2,7),
				array('非常食','HB',100,1,'',99,20,20,50,2,7),
				array('龙料理','HB',150,2,'',119,20,20,50,2,7),
				array('亲手制作的鲷鱼烧','HB',500,150,'',3777,0,50,10,3,7),
				array('培根蛋+？','HB',500,150,'',3777,0,50,10,3,7),
				array('秋生大叔的面包','HB',500,150,'',3777,0,50,10,3,7)
			)
		),
		2 => array( //药剂
			'min' => 1,
			'max' => 1,
			'items' => array(
				array('全恢复药剂','Ca',1,1,'',60,10,50,100,1,7)
			)
		),
		3 => array( //武器材料
			'min' => 4,
			'max' => 6,
			'items' => array(
				array('『延展御柱』','WP','400','30','N',2100,0,30,20,1,4),
				array('最终战术『蝎尾』','WP',65500,'∞','Zrcd',65500,0,0,1,5,7),
				array('【红杀铁剑】','WK',70,35,'u',1000,0,30,20,1,4),
				array('最终战术『剑海』','WK',65500,'∞','Zrcd',65500,0,0,1,5,7),
				array('实体子弹','GBss',1,10,'',15,10,10,30,1,7),
				array('能量弹药','GBee',1,10,'',18,10,10,30,1,7),
				array('重装子弹','GBh',1,1,'',220,10,10,10,2,7),
				array('『AK-47』','WG',140,20,'r',2000,0,30,15,1,4),
				array('冷冻光束枪','WG',233,20,'i',3800,0,30,5,1,4),
				array('『巴雷特M82A1』','WJ',600,1,'Nnj',12000,0,30,5,3,5),
				array('最终战术『银花』','WG',65500,'∞','Zrcd',65500,0,0,1,5,7),
				array('游戏王卡包','ygo',1,1,'',110,10,10,10,1,5),
				array('《现代游戏王》','ygo2',1,1,'',233,10,10,10,1,5),
				array('☆叠♂放☆','X',1,1,'',5000,0,20,5,3,6),
				array('☆四星认证☆','X',4,1,'',400,3,20,10,1,4),
				array('☆五星认证☆','X',5,1,'',1200,3,20,8,2,4),
				array('☆六星认证☆','X',6,1,'',1500,3,20,4,2,4),
				array('☆七星认证☆','X',7,1,'',2000,0,20,4,2,4),
				array('☆八星认证☆','X',8,1,'',4000,0,20,10,2,4),
				array('☆十星认证☆','X',10,1,'',5000,0,20,10,3,6),
				array('★神卡认证★','X',12,1,'',12000,0,20,5,3,7),
				array('★连接认证1★','X',1,1,'',1200,0,20,8,1,4),
				array('★连接认证2★','X',2,1,'',2400,0,20,8,1,4),
				array('★连接认证3★','X',3,1,'',4000,0,20,8,3,6),
				array('★连接认证4★','X',4,1,'',6000,0,20,8,3,6),
				array('最终战术『光矢』','WB',65500,'∞','Zrcd',65500,0,0,1,5,7),
				array('『破坏之杖』','WD',140,40,'d',800,0,20,10,1,4),
				array('密封的酒瓶','X',1,1,'',3000,2,20,10,1,5),
				array('『真空内爆弹』','WD',280,30,'d',2400,0,20,10,1,5),
				array('最终战术『心火』','WD',65500,'∞','Zrcd',65500,0,0,1,5,7),
				array('☆博丽护符☆','X',1,1,'',300,0,20,6,1,3),
				array('☆山蘑菇粉☆','X',1,1,'',300,0,20,6,1,3),
				array('★时停怀表★','X',1,1,'',800,0,20,6,1,3),
				array('★伊吹瓢★','X',1,1,'',1300,0,20,6,1,3),
				array('★制御棒★','X',1,1,'','^res_$$CK-ZSF%$KJ%oi/%a-J%YWo%--h%%CG%Yi@%bqm$$CLLFZTLDEsMSw#MDUs1^rtype1',5600,0,20,6,3,6),
				array('☆残页的魔导书☆','X',1,1,'',300,2,20,10,1,5),
				array('《魔女的魔导书》','X',1,1,'',5500,2,20,10,2,6),
				array('魔导迷城『糖风』','WF',65500,'∞','Zrcd',65500,0,0,1,5,7)
			)
		),
		4 => array( //防具
			'min' => 1,
			'max' => 2,
			'items' => array(
				array('埃克法-幻影','DB',5,25,'HZ',10,0,0,100,1,5),
				array('『劲爆小包』','DBS',10,10,'^st_1^vol5',3000,0,20,20,3,7),
				array('『动力外骨骼』','DBS',500,100,'R',5000,0,20,20,3,7),
				array('数据……碎片','DB',3756,7,'Z',32768,0,20,10,4,7),
				array('★诅咒铠甲★','DBS',400,40,'^hu400',12000,0,20,50,4,7),
				array('★荆棘王冠★','DHS',300,30,'^hu300',9000,0,20,50,3,6),
				array('★振金神盾★','DAS',200,20,'^hu200',6000,0,20,50,2,5),
				array('★共享单车★','DFS',100,10,'^hu100',3000,0,20,50,1,4),
				array('真-红色的发圈','DH',500,150,'KG',3777,0,30,20,3,7),
				array('小空','DA',500,150,'CD',3777,0,30,20,3,7),
				array('真 - 幻想戏服','DB',500,150,'PF',3777,0,30,20,3,7)
			)
		),
		
		
		5 => array( //书籍和杂物
			'min' => 2,
			'max' => 3,
			'items' => array(
				array('水果刀','Z',1,1,'^ac1^alt_<:comp_itmsk:>{WK}1',150,0,20,30,1,7),
				array('礼品盒','p',1,1,'',777,7,20,10,3,7),
				array('凸眼鱼','Y',1,1,'',150,6,20,10,3,7),
				array('驱云弹','EW',1,1,'1',100,0,20,10,1,7),
				array('毒药','Y',1,1,'',5,5,20,30,1,5),
				array('电池','BE',2,1,'',20,5,20,30,1,5),
				array('★阔剑地雷★','TN',810,1,'',1000,0,30,10,1,4),
				array('☆★☆大打击☆★☆','TN',1770,1,'',3500,0,30,5,1,4),
				array('★荆棘式电子地雷★','TN',2000,1,'',2000,0,30,10,5,7),
				array('《小黄的收服特训》','VC',253,1,'',3800,0,30,10,2,7),
				array('《曾伽·宗博尔特自传》','VK',320,1,'',7000,0,30,10,2,7),
				array('《小黄的常磐之力》','VC',150,1,'^res_<:comp_itmsk:>{《小黄的治愈之力》,VS,1,1,76,}1^rtype1',3000,0,30,10,2,7),
				array('《东方灵异传》','VF',300,1,'',6300,0,30,10,2,7),
				array('《蘑菇种植指南》','VD',300,1,'',6300,0,30,10,2,7),
				array('《太平要术》','VS',1,1,'249',1000,0,30,5,1,4),
				array('《占星术导论》','VS',1,1,'250',1500,0,30,5,1,4)
			)
		),
		
		6 => array( //强化道具
			'min' => 2,
			'max' => 3,
			'items' => array(
				array('钢钉','Y',60,1,'',300,25,30,50,1,6),
				array('贤者之磨刀石','Y',60,1,'',480,25,30,50,1,6),
				array('自动叠甲装置','YS',10,1,'',24,120,30,40,1,7),
				array('『祝福宝石』','Y',1,1,'Z',1500,4,30,30,1,7),
				array('『灵魂宝石』','Y',1,1,'Z',2500,4,30,20,3,7),
				array('武器改造晶体·山铜','EI',1,1,'',5000,2,30,30,2,7),
				array('武器改造晶体·精钢','EI',1,1,'1',6000,2,30,15,2,7),
				array('武器改造晶体·绯金','EI',1,1,'2',10000,2,30,5,5,7),
				array('R.M.『霜铸炎甲』','EA',1,1,'',4000,2,30,30,3,7),
				array('改造核心·C级','EC',1,1,'',600,0,20,30,1,4),
				array('改造核心·B级','EC',1,1,'1',2500,0,20,30,2,5),
				array('改造核心·A级','EC',1,1,'2',9000,0,20,30,3,6),
				array('改造核心·S级','EC',1,1,'3',20000,0,20,30,4,7)
			)
		),
		7 => array( //随机物
			'min' => 1,
			'max' => 2,
			'items' => array(
				array('【Alicemagic】','ss',30,1,'',1500,0,30,20,1,5),
				array('【Crow Song】','ss',90,1,'',2000,0,30,20,1,5),
				array('【雨だれの歌】','ss',60,1,'',3000,0,30,10,3,7),
				array('红色方块','X',1,1,'',600,2,30,50,1,7),
				array('绿色方块','X',1,1,'',600,2,30,50,1,7),
				array('蓝色方块','X',1,1,'',600,2,30,50,1,7),
				array('黄色方块','X',1,1,'',600,2,30,50,1,7),
				array('金色方块','X',1,1,'',600,2,30,50,1,7),
				array('银色方块','X',1,1,'',600,2,30,50,1,7),
				array('水晶方块','X',1,1,'',600,2,30,50,1,7),
				array('黑色方块','X',1,1,'',600,2,30,50,1,7),
				array('白色方块','X',1,1,'',600,2,30,50,1,7)
			)
		),
		8 => array( //技能
			'min' => 1,
			'max' => 2,
			'items' => array(
				array('★技能手册·C级★','VS',1,1,'rdsk_C',600,0,30,50,1,5),
				array('★技能手册·B级★','VS',1,1,'rdsk_B',1200,0,30,40,2,6),
				array('★技能手册·A级★','VS',1,1,'rdsk_A',2400,0,30,25,4,7),
				array('★技能手册·S级★','VS',1,1,'rdsk_S',3600,0,30,10,6,7)
			)
		),
		9 => array( //卡片
			'min' => 2,
			'max' => 3,
			'items' => array(
				array('★透明卡砖·C级★','VO1',1,1,'card_C',800,0,20,50,1,5),
				array('★透明卡砖·B级★','VO1',1,1,'card_B',1600,0,20,40,2,6),
				array('★透明卡砖·A级★','VO1',1,1,'card_A',2400,0,20,30,4,7),
				array('★透明卡砖·S级★','VO1',1,1,'card_S',4000,0,20,20,6,7)
			)
		)
	);
	
}

?>